#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [5]:
my_pd_series = pd.Series([4, 8, 15, 16, 23, 42])
print(my_pd_series)
print(type(my_pd_series))

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64
<class 'pandas.core.series.Series'>

___

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [9]:
my_list = [x for x in range(1, 20, 2)]
print(my_list)
my_series = pd.Series(my_list)
print(my_series)

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]
0     1
1     3
2     5
3     7
4     9
5    11
6    13
7    15
8    17
9    19
dtype: int64

___

#### Q3. Create a Pandas DataFrame that contains the following data:
|Name|Age|Gender|
|:--:|:-:|:----:|
|Alice|25|Female|
|Bob|30|Male|
|Claire|27|Female|

In [12]:
user_dict = [
    {'name' : 'Alice', 'Age' : 25, 'Gender' : 'Female'},
    {'name' : 'Bob', 'Age' : 30, 'Gender' : 'Male'},
    {'name' : 'Claire', 'Age' : 27, 'Gender' : 'Female'}
]

user_table = pd.DataFrame(user_dict)
print(user_table)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

___

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

**DataFrame** is a two-dimensional labeled data structure that represents a table of data with rows and columns.
A **Pandas Series**, on the other hand, is a one-dimensional labeled array that can hold data of any type. It represents a single column of data in a DataFrame.

In [30]:
# Example:

import pandas as pd

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'London', 'Paris', 'Tokyo'],
    'Salary' : [3000, 4900, '', 2800]
}
df = pd.DataFrame(data)

print(f"{type(df)}\n{df}")

# Accessing a column as a Series
name_series = df['Name']
print(f"\n{type(name_series)}\n{name_series}")

<class 'pandas.core.frame.DataFrame'>
      Name  Age      City Salary
0    Alice   25  New York   3000
1      Bob   30    London   4900
2  Charlie   35     Paris
3    David   40     Tokyo   2800

<class 'pandas.core.series.Series'>
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

___

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

1. `head()` and `tail()`: These functions allow you to retrieve the first few rows (`head()`) or the last few rows (`tail()`) of the DataFrame. They are useful for quickly inspecting the structure and content of the data.

In [24]:
# Example: When we are working with a large dataframes, it would be easy to understand the structure of raw data with head() and/or tail()

results = pd.read_csv("data_files/detailed_result.csv")

# Using head() to check the structure of data.
results.head()

,District,Constituency No.,Constituency Name,Winner Candidate,Winner Party,Winner Votes,Winner %,Runner Up Candidate,Runner Up Party,Runner Up Votes,Runner Up %,Margin
0,Belagavi,1,Nippani,Shashikala Jolle,BJP,73348.0,39.14,Uttam Raosaheb Patil,NCP,66056,35.25,7292
1,Belagavi,2,Chikkodi-Sadalga,Ganesh Hukkeri,INC,128349.0,69.82,Ramesh Katti,BJP,49840,27.11,78509
2,Belagavi,3,Athani,Laxman Savadi,INC,131404.0,68.34,Mahesh Kumathalli,BJP,55282,28.75,76122
3,Belagavi,4,Kagwad,Raju Kage,INC,83887.0,51.45,Shrimant Patil,BJP,74560,46.00,9327
4,Belagavi,5,Kudachi (SC),Mahendra Tammannavar,INC,85321.0,56.87,P. Rajeev,BJP,60078,40.04,25243

2. `info()`: This function provides a summary of the DataFrame, including the column names, data types, and memory usage. It is helpful for understanding the data types and identifying any missing values.

In [27]:
#Example:
df.info

<bound method DataFrame.info of       Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo>

3. `describe()`: This function generates descriptive statistics of the numerical columns in the DataFrame, such as count, mean, standard deviation, minimum, maximum, and quartile values. It provides insights into the distribution and central tendencies of the data.

In [26]:
# Example:
results.describe()

,Constituency No.,Winner Votes,Winner %,Runner Up Votes,Runner Up %,Margin
count,224.000000,224.000000,224.000000,224.000000,224.000000,224.000000
mean,112.500000,86177.926174,49.559464,65535.334821,37.547098,20979.535714
std,64.807407,21869.826428,7.517976,17701.285185,6.964289,17872.183975
min,1.000000,95.463000,29.400000,20631.000000,11.080000,16.000000
25%,56.750000,73311.000000,45.110000,54130.750000,32.312500,7842.500000
50%,112.500000,84412.500000,49.585000,64380.000000,38.415000,15968.500000
75%,168.250000,94654.000000,53.837500,74074.750000,43.607500,30774.500000
max,224.000000,196220.000000,74.580000,154031.000000,47.850000,122392.000000

4. `fillna()`: This function is used to fill missing values in the DataFrame with a specified value or using various filling strategies such as forward fill or backward fill. It helps handle missing data effectively.

___

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are mutable in nature, 

___

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [33]:
# Creating multiple Series
name_series = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
age_series = pd.Series([25, 30, 35, 40])
city_series = pd.Series(['New York', 'London', 'Paris', 'Tokyo'])
salary_series = pd.Series([2000, 2700, 2800, 3000])

# Createing a Dataframe from above seires
random_users = pd.DataFrame({
    'Name' : name_series,
    'Age' : age_series,
    'City' : city_series,
    'Salary' : salary_series
})

random_users

      Name  Age      City  Salary
0    Alice   25  New York    2000
1      Bob   30    London    2700
2  Charlie   35     Paris    2800
3    David   40     Tokyo    3000

___